<a href="https://colab.research.google.com/github/tinhb92/relax_ml/blob/master/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
! pip install -U pandasql

Collecting pandasql
  Downloading https://files.pythonhosted.org/packages/6b/c4/ee4096ffa2eeeca0c749b26f0371bd26aa5c8b611c43de99a4f86d3de0a7/pandasql-0.7.3.tar.gz
Requirement already satisfied, skipping upgrade: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.16.5)
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (0.24.2)
Requirement already satisfied, skipping upgrade: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.8)
Requirement already satisfied, skipping upgrade: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.5.0 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.5.3)
Requirement already satisfied, skipping upgrade: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.5.0->pandas->pandasql) (1.12.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-cp36-none-any.whl size=26820 sha256=d916e97aa6b6af3e5f4950a97b76a99941981a2daf6dcb51ceaee49e5d8af614
  Stored in directory: /root/.cache/pip/wheels/53/6c/18/b87a2e5fa8a82e9c026311de56210b8d1c01846e18a9607fc9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [0]:
from pandasql import sqldf, load_meat, load_births

In [0]:
pysqldf = lambda q: sqldf(q, globals())

In [0]:
births = load_births()

In [0]:
pysqldf("SELECT beef FROM meat WHERE beef>751").head()

    beef
0  787.0
1  774.0
2  834.0
3  786.0
4  764.0

In [0]:
pysqldf("SELECT SUM(CASE When beef>751 Then 1 Else 0 End ) as sum_beef FROM meat;").head()

   sum_beef
0       783

In [0]:
pysqldf("SELECT SUM(CASE When beef>751 Then beef Else 0 End ) as sum_beef FROM meat;").head()

    sum_beef
0  1361964.2

In [12]:
!pip install pydbgen

Collecting pydbgen
  Downloading https://files.pythonhosted.org/packages/0d/4b/3b9e324838d4640a0b5eb9e452a6af6876625a6343c065ef0323921955b7/pydbgen-1.0.5-py3-none-any.whl (81kB)
     |████████████████████████████████| 81kB 3.0MB/s
Collecting Faker (from pydbgen)
  Downloading https://files.pythonhosted.org/packages/bf/5a/44c04abc182990d716eb7703502aa851433ea66569bd72765ef1abdaea9c/Faker-2.0.2-py2.py3-none-any.whl (879kB)
     |████████████████████████████████| 880kB 8.0MB/s
Requirement already satisfied: Pandas in /usr/local/lib/python3.6/dist-packages (from pydbgen) (0.24.2)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from pydbgen) (1.12.0)
Requirement already satisfied: python-dateutil>=2.4 in /usr/local/lib/python3.6/dist-packages (from Faker->pydbgen) (2.5.3)
Requirement already satisfied: text-unidecode==1.3 in /usr/local/lib/python3.6/dist-packages (from Faker->pydbgen) (1.3)
Requirement already satisfied: numpy>=1.12.0 in /usr/local/lib/python3.6/dist-packages (from Pandas->pydbgen) (1.16.5)
Requirement already satisfied: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from Pandas->pydbgen) (2018.9)
Installing collected packages: Faker, pydbgen
Successfully installed Faker-2.0.2 pydbgen-1.0.5

In [0]:
import pydbgen
from pydbgen import pydbgen
myDB=pydbgen.pydb()

In [19]:
df_name = myDB.gen_dataframe(20,['name','city','phone'], seed = 8)
df_name['id'] = range(20)
df_name.head()

           name         city  phone-number  id
0  Caitlin Page  Clark Mills  245-346-1101   0
1  Tyler Hudson    Pottsboro  950-050-2201   1
2  Caitlin Mora  Carter Lake  497-036-4065   2
3  Tracey Davis  Mount Tabor  636-813-0448   3
4   Howard Vang    Vanceburg  165-144-8019   4

In [21]:
pysqldf("SELECT * FROM df_name LIMIT 1").head()

           name         city  phone-number  id
0  Caitlin Page  Clark Mills  245-346-1101   0

In [22]:
df_company = myDB.gen_dataframe(20,['company','country','city'])
df_company['id'] = range(20)
df_company.head()

          company                      country          city  id
0     Wolfe Group                      Jamaica      Old Fort   0
1  Rogers-Whitney                        Chile    Warm Beach   1
2   Parrish Group  French Southern Territories      Hahntown   2
3     Adams Group                       Mexico          Lulu   3
4  Carter-Johnson                       Jersey  Spragueville   4

In [0]:
testdf=myDB.gen_dataframe(20,['name','city','phone','date'])

Multiple table; synthetic data for practice

In [0]:
q = """
SELECT * FROM df_name
INNER JOIN df_company
ON df_name.id = df_company.id
"""

Use the result as one table, nested

In [0]:
q = """
SELECT name FROM 
(SELECT * FROM df0 
INNER JOIN df1 
ON df0.id=df1.id) a
"""

In [0]:
q = """
SELECT a.name FROM 
(SELECT * FROM df0 
INNER JOIN df1 
ON df0.id=df1.id) a
"""

In [30]:
pysqldf(q).head()

           name         city  ...          city  id
0  Caitlin Page  Clark Mills  ...      Old Fort   0
1  Tyler Hudson    Pottsboro  ...    Warm Beach   1
2  Caitlin Mora  Carter Lake  ...      Hahntown   2
3  Tracey Davis  Mount Tabor  ...          Lulu   3
4   Howard Vang    Vanceburg  ...  Spragueville   4

[5 rows x 8 columns]

Inner join 2 nested

In [0]:
pysqldf("SELECT * FROM meat ORDER BY beef").head()

                         date   beef  veal  ...  broilers  other_chicken  turkey
0  1946-09-01 00:00:00.000000  366.0  98.0  ...       NaN            NaN     NaN
1  1946-06-01 00:00:00.000000  461.0  78.0  ...       NaN            NaN     NaN
2  1951-06-01 00:00:00.000000  591.0  78.0  ...       NaN            NaN     NaN
3  1946-05-01 00:00:00.000000  605.0  83.0  ...       NaN            NaN     NaN
4  1944-04-01 00:00:00.000000  650.0  89.0  ...       NaN            NaN     NaN

[5 rows x 8 columns]

In [0]:
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""

In [0]:
joined = pysqldf(q)

In [0]:
q = """select
           strftime('%Y', date) as year
           , SUM(beef) as beef_total
           FROM
              meat
           GROUP BY
              year;"""

In [0]:
pysqldf(q).head()

   year  beef_total
0  1944      8801.0
1  1945      9936.0
2  1946      9010.0
3  1947     10096.0
4  1948      8766.0